[
  {
    "id": 0,
    "title": "lisa-hobbs",
    "name": "Lisa-Hobbs.com",
    "descriptionShort": "First AngularJS project: revamped my personal website",
    "descriptionLong": "I am currently working on learning the MEAN stack.  After taking the introduction course of AngularJS I needed a project to put what I learned in the course into practice.  I decided to redo my website using Angular. I've continued to keep up with the changes of Angular 2 and redid my initial project as an Angular 2.2 project.",
    "images": {
        "icon": "/images/lisahobbscom.PNG"
      },
    "links": [
    {
      "description": "CodeSchool Report Card",
      "url": "https://www.codeschool.com/users/2561348"
      },
      {
        "description": "Source Code",
        "url": "https://github.com/lhobbs/lisa-hobbs"
      }
      ],
    "categories": [{ "description": "Web Development"}, {"description": "AngularJS"}]
  },
  {
    "id": 1,
    "title": "ready-set-go",
    "name": "ReadySetGo!",
    "descriptionShort": "ReadySetGo! is a Ruby on Rails application used for team fitness competitions by tracking data though fitness devices, such as the Jawbone.",
    "descriptionLong": "ReadySetGo is a web portal to facilitate competition between users, their teams members, other teams and even other companies! Since we’re all so busy competing, the web portal is designed to handle the back-end syncing of each user’s wearable device and then compare each users’ progress to see who’s winning and... who’s not. Competition is always better in teams, so the portal will allow team captains to recruit their owner minions and push them to achieve their greatest via a variety of customizable competitive challenges. Can you handle it? Ready… Go!",
    "images": {
        "icon": "/images/jawbones.PNG",
        "poster": "/images/ReadySetGoPoster.jpg"
      },
    "links": [    ],
    "categories": [{ "description": "Web Development"}, {"description": "Ruby on Rails"}]
  },
  {
    "id": 2,
    "title": "lisas-play-board",
    "name": "Lisa's Play Board",
    "descriptionShort": "Lisa’s Play Board is a platform to be used for children’s games that promote growth in cognitive and motor skills. ",
    "descriptionLong": "Lisa’s Play Board is a platform to be used for children’s games that promote growth in cognitive and motor skills. The bases of this interactive game board are the hardware pieces that consist of four quadrants that can be used for different games. The quadrants respond based on pressure, so the games need a physical piece such as tangible objects or force exerted by players stepping or pressing on each quadrant. Having to press, step or jump on the board allows more physical activity to occur during play which can help with motor development. The responsiveness of the board with the software games allow the child to have immediate feedback of what they are doing which can help with different cognitive tasks involved in games.",
    "images":  {
        "icon": "/images/playboard_small.jpg",
        "poster": "/images/lisaplayboard.jpg"
      }
      ,
    "links": [
    {
      "description": "Technical Document",
      "url": "http://lisa-hobbs.com/LisaPlayBoard.pdf"
      },
      {
        "description": "Demo Video",
        "url": "https://www.youtube.com/watch?v=yBr6qT3EEgw"
      },
      {
        "description": "Source Code",
        "url": "https://github.com/lhobbs/LisaPlayBoard"
      }
      ],
    "categories": [{ "description": "Arduino"}, {"description": "Python"}]
  },
  {
    "id": 3,
    "title": "snoflake-lockscreen",
    "name": "Snowflake Lockscreen for Android",
    "descriptionShort": "Lockscreen for Android device that opens with a swipe of a snowflake.",
    "descriptionLong": "This lockscreen has a blue snowflake that can be dragged down to open the phone to the home screen.  There are other snowflakes that can be tapped to launch other applications.  The yellow snowflake opens Snapchat, the orange snowflake opens Messages and the grey snowflake opens the camera.  I am planning on extending this widget to show notifications and be more customizeable.",
    "images": {
        "icon": "/images/lockscreen_diagram.jpg",
        "poster": "/images/snowflakelockscreen.jpg"
      },
    "links": [
      {
        "description": "Source Code",
        "url": "https://github.com/lhobbs/SnowflakeLockScreen"
      }
      ],
    "categories": [{ "description": "Android"}]
  },
  {
    "id": 4,
    "title": "yaf-app",
    "name": "Young Adult Fellowship App",
    "descriptionShort": "React Native app to keep people in my bible study connected",
    "descriptionLong": "",
    "images": {
        "icon": "/images/yaf_screenshots.jpg"
      },
    "links": [
      {
        "description": "Source Code",
        "url": "https://github.com/lhobbs/yaf-app"
      }
      ],
    "categories": [{ "description" : "React Native"}, { "description" : "Mobile"}, { "description": "Android"}]
  }
]